Tekla.Structures.Drawing.AlongLineOrWithLeaderLineAndParentObjectAlongPartPlacingType
The AlongLineOrWithLeaderLineAndParentObjectAlongPartPlacingType class defines
a placing type that places the object using the along line placing as the first option.
If there is no room for the first option the fallback option will be used.
The fallback option is placing the object with a leader line and rotated to be at the
same angle as the connected part.

Tekla.Structures.Drawing.AlongLineOrWithLeaderLineAndParentObjectAlongPartPlacingType.#ctor
Creates a new along line or with leader line and parent object along part placing type instance.